Revit 2024 API
BuiltInFailures.StairRampFailures.NoRunsRamp Property
 Ramp has no Runs. Can't create Ramp.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NoRunsRamp { get; }
Visual Basic
Public Shared ReadOnly Property NoRunsRamp As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NoRunsRamp {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace